Билет5/src/DataProcessors/Кросс_таблица/Кросс_таблица.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>Кросс_таблица</name>
</mdclass:DataProcessor>

Билет5/src/AccumulationRegisters/ОстаткиНоменклатуры/ОстаткиНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиНоменклатуры</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партия</name>
    <type>
      <types>DocumentRef.ПриходнаяНакладная</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Билет5/src/DataProcessors/Кросс_таблица/Forms/Форма/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Период.ДатаНачала = НачалоГода(ТекущаяДатаСеанса());
	Период.ДатаОкончания = ТекущаяДатаСеанса();
	СформироватьОтчетНаСервере();

КонецПроцедуры

&НаСервере
Функция СформироватьОтчетНаСервере()
	
	РезультатТабличныйДокумент.Очистить();
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	Макет = ОбработкаОбъект.ПолучитьМакет("Макет");
	
	ОбластьШапкаТовар = Макет.ПолучитьОбласть("Шапка|Товар");
	ОбластьШапкаСклад = Макет.ПолучитьОбласть("Шапка|Склад");
	ОбластьШапкаИтог = Макет.ПолучитьОбласть("Шапка|Итог");
	
	ОбластьСтрокаТовар = Макет.ПолучитьОбласть("Строка|Товар");
	ОбластьСтрокаСклад = Макет.ПолучитьОбласть("Строка|Склад");
	ОбластьСтрокаИтог = Макет.ПолучитьОбласть("Строка|Итог");
	
	
	ОбластьПодвалТовар = Макет.ПолучитьОбласть("Подвал|Товар");
	ОбластьПодвалСклад= Макет.ПолучитьОбласть("Подвал|Склад");
	ОбластьПодвалИтог = Макет.ПолучитьОбласть("Подвал|Итог");

	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПРЕДСТАВЛЕНИЕ(ОстаткиНоменклатуры.Склад) КАК Склад,
	|	ПРЕДСТАВЛЕНИЕ(ОстаткиНоменклатуры.Номенклатура) КАК Номенклатура,
	|	ОстаткиНоменклатуры.КоличествоОстаток КАК Количество
	|ИЗ
	|	РегистрНакопления.ОстаткиНоменклатуры.Остатки(&Период, ) КАК ОстаткиНоменклатуры
	|ИТОГИ
	|	СУММА(Количество)
	|ПО
	|	ОБЩИЕ,
	|	Склад,
	|	Номенклатура";
	
	Запрос.УстановитьПараметр("Период",Период.ДатаОкончания);
	
	Результат = Запрос.Выполнить();
	Если НЕ Результат.Пустой() Тогда
		РезультатТабличныйДокумент.Вывести(ОбластьШапкаТовар);
		
		ВыборкаСклад = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"Склад");
		Пока ВыборкаСклад.Следующий() Цикл
			ОбластьШапкаСклад.Параметры.Заполнить(ВыборкаСклад);
			РезультатТабличныйДокумент.Присоединить(ОбластьШапкаСклад);
		КонецЦикла;
	КонецЕсли;
	РезультатТабличныйДокумент.Присоединить(ОбластьШапкаИтог);
	
	ВыборкаТовар = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"Номенклатура");
	Пока ВыборкаТовар.Следующий() Цикл
		ОбластьСтрокаТовар.Параметры.Заполнить(ВыборкаТовар);
		РезультатТабличныйДокумент.Вывести(ОбластьСтрокаТовар);
		
		ВыборкаСкладС = ВыборкаТовар.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"Склад","ВСЕ");
		Пока ВыборкаСкладС.Следующий() Цикл
			ОбластьСтрокаСклад.Параметры.Заполнить(ВыборкаСкладС);
			РезультатТабличныйДокумент.Присоединить(ОбластьСтрокаСклад); 
		КонецЦикла; 
		
		ОбластьСтрокаИтог.Параметры.Заполнить(ВыборкаТовар);
		РезультатТабличныйДокумент.Присоединить(ОбластьСтрокаИтог);

	КонецЦикла;
	РезультатТабличныйДокумент.Вывести(ОбластьПодвалТовар);
	
	ВыборкаСклад.Сбросить();
	Пока ВыборкаСклад.Следующий() Цикл
		ОбластьПодвалСклад.Параметры.Заполнить(ВыборкаСклад);
		РезультатТабличныйДокумент.Присоединить(ОбластьПодвалСклад);
	КонецЦикла;
	
	ВыборкаИтог = Результат.Выбрать();
	Если ВыборкаИтог.Следующий() Тогда
		ОбластьПодвалИтог.Параметры.Заполнить(ВыборкаИтог); 
		РезультатТабличныйДокумент.Присоединить(ОбластьПодвалИтог);
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	
	СформироватьОтчетНаСервере();
	
КонецПроцедуры
